<template>
  <!-- ВНЕШНИЙ ВИД КОМПОНЕНТА (HTML РАЗМЕТКА)-->
</template>



<script>
/* ЭКСПОРТИРУЕМ НАРУЖУ ОБЪЕКТ С ОПИСАНИЕМ КОМПОНЕНТА, ЧТОБЫ МОЖНО БЫЛО ИСПОЛЬЗОВАТЬ */
export default {
// описание компонента:
// data, computed, methods, props, emits, хуки жизненного цикла
}
</script>

<style>
/*  ГЛОБАЛЬНЫЕ СТИЛИ (ДОСТУПНЫ ВСЕМ КОМПОНЕНТАМ)(ПРИ СБОРКЕ СОБЕРЕТСЯ В CSS)*/
/*
атрибуты тега style:
lang="css" - значение по умолчанию, css синтаксис
(можем использовать синтаксис любого препроцессора saas и т.д)
lang="sass" - sass синтаксис
lang="scss" - scss синтаксис
lang="less" - less синтаксис
*/


/* ЛОКАЛЬНЫЕ СТИЛИ (ДОСТУПНЫ ОДНОМУ КОМПОНЕНТУ) */
/* <style lang="css" scoped>*/

</style>

